### Terraform Plan — `dev` ✅

<details><summary>Show plan</summary>

```hcl
module.platform.aws_iam_role.k3s: Refreshing state... [id=ai-demo-dev-role-k3s]
module.platform.aws_iam_role.bastion: Refreshing state... [id=ai-demo-dev-role-bastion]
module.platform.module.network.aws_vpc.main: Refreshing state... [id=vpc-0871da9108e0908be]
module.platform.module.bastion.data.aws_ami.ubuntu: Reading...
module.platform.aws_iam_role_policy_attachment.bastion_ssm_core: Refreshing state... [id=ai-demo-dev-role-bastion-20260310162619989300000002]
module.platform.aws_iam_role_policy.bastion_ec2_describe: Refreshing state... [id=ai-demo-dev-role-bastion:ai-demo-dev-policy-bastion-ec2]
module.platform.aws_iam_instance_profile.bastion: Refreshing state... [id=ai-demo-dev-profile-bastion]
module.platform.aws_iam_role_policy_attachment.k3s_ssm_core: Refreshing state... [id=ai-demo-dev-role-k3s-20260310162619871100000001]
module.platform.aws_iam_instance_profile.k3s: Refreshing state... [id=ai-demo-dev-profile-k3s]
module.platform.aws_iam_role_policy.k3s_ssm: Refreshing state... [id=ai-demo-dev-role-k3s:ai-demo-dev-policy-k3s-ssm]
module.platform.module.bastion.data.aws_ami.ubuntu: Read complete after 0s [id=ami-0bb8b77ad97138af1]
module.platform.module.network.aws_internet_gateway.main: Refreshing state... [id=igw-0a05dde141b17554a]
module.platform.module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0a07bbdb1739d2545]
module.platform.module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-0bfb5f4c3365631ce]
module.platform.module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0ee442a833406832b]
module.platform.module.network.aws_security_group.bastion: Refreshing state... [id=sg-0daa30b412509bacf]
module.platform.module.network.aws_route_table.public: Refreshing state... [id=rtb-0f221a629d547cab7]
module.platform.module.network.aws_security_group.k3s: Refreshing state... [id=sg-0dfacb00b177df5d6]
module.platform.module.bastion.aws_instance.bastion: Refreshing state... [id=i-0a93670f7d9890a37]
module.platform.module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ae78fa3c61cee1cf]
module.platform.module.bastion.aws_eip.bastion: Refreshing state... [id=eipalloc-060d5025d1c315ad1]
module.platform.aws_route_table.private[1]: Refreshing state... [id=rtb-062b637f995f4d6f2]
module.platform.aws_route_table.private[0]: Refreshing state... [id=rtb-050ce466e5153bd2a]
module.platform.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d8f92d90b7355702]
module.platform.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-025bc2b9a80deb268]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform.aws_ssm_parameter.k3s_token will be created
  + resource "aws_ssm_parameter" "k3s_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/ai-demo/dev/k3s-token"
      + tags           = {
          + "Name" = "ai-demo-dev-k3s-token"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ai-demo-dev-k3s-token"
          + "Project"     = "ai-demo"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.platform.random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.platform.module.k3s_masters.data.aws_ami.ubuntu will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + last_launched_time    = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "099720109477",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + "ubuntu/images/hvm-ssd-gp3/ubuntu-noble-24.04-amd64-server-*",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.platform.module.k3s_masters.aws_instance.master[0] will be created
  + resource "aws_instance" "master" {
      + ami                                  = (known after apply)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ai-demo-dev-profile-k3s"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0ee442a833406832b"
      + tags                                 = {
          + "Name"        = "ai-demo-dev-k3s-master-1"
          + "Role"        = "k3s-master"
          + "environment" = "dev"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ai-demo-dev-k3s-master-1"
          + "Project"     = "ai-demo"
          + "Role"        = "k3s-master"
          + "environment" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0dfacb00b177df5d6",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.platform.module.k3s_masters.aws_instance.master[1] will be created
  + resource "aws_instance" "master" {
      + ami                                  = (known after apply)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "ai-demo-dev-profile-k3s"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0bfb5f4c3365631ce"
      + tags                                 = {
          + "Name"        = "ai-demo-dev-k3s-master-2"
          + "Role"        = "k3s-master"
          + "environment" = "dev"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ai-demo-dev-k3s-master-2"
          + "Project"     = "ai-demo"
          + "Role"        = "k3s-master"
          + "environment" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive value)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-0dfacb00b177df5d6",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 30
          + volume_type           = "gp3"
        }
    }

  # module.platform.module.k3s_workers.data.aws_ami.ubuntu will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "ubuntu" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + last_launched_time    = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "099720109477",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + "ubuntu/images/hvm-ssd-gp3/ubuntu-noble-24.04-amd64-server-*",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.platform.module.k3s_workers.aws_autoscaling_group.workers will be created
  + resource "aws_autoscaling_group" "workers" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 4
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 6
      + metrics_granularity              = "1Minute"
      + min_size                         = 0
      + name                             = "ai-demo-dev-k3s-workers-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-0bfb5f4c3365631ce",
          + "subnet-0ee442a833406832b",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "ai-demo-dev-k3s-worker"
        }

      + traffic_source (known after apply)
    }

  # module.platform.module.k3s_workers.aws_launch_template.worker will be created
  + resource "aws_launch_template" "worker" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = "t3.micro"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "ai-demo-dev-k3s-worker-"
      + tags_all        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ai-demo"
        }
      + user_data       = (sensitive value)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "ai-demo-dev-profile-k3s"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "false"
          + security_groups             = [
              + "sg-0dfacb00b177df5d6",
            ]
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"        = "ai-demo-dev-k3s-worker"
              + "Role"        = "k3s-worker"
              + "environment" = "dev"
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssm_connect_masters = {
      + master-1 = (known after apply)
      + master-2 = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

> Triggered by @pve159 on `fix/workflow`